app/controllers/admin/analytics_controller.rb

  def index
    # Overall statistics
    @total_revenue = Order.completed.sum(:total_amount)
    @total_orders = Order.count
    @total_users = User.count
    @total_menu_items = MenuItem.count

    # Recent statistics (last 7 days)
    @recent_revenue = Order.completed.where('created_at >= ?', 7.days.ago).sum(:total_amount)
    @recent_orders = Order.where('created_at >= ?', 7.days.ago).count
    @recent_users = User.where('created_at >= ?', 7.days.ago).count

    # Order statistics by status
    @orders_by_status = Order.group(:status).count

    # Orders by day for the last 7 days
    @orders_by_day = Order.where('created_at >= ?', 7.days.ago)
                         .group("DATE(created_at)")
                         .order("DATE(created_at)")
                         .count
---
SELECT COUNT(*) AS "count_all", DATE(created_at) AS "date_created_at" FROM "orders" WHERE (created_at >= '2025-08-27 00:19:04.269120') GROUP BY DATE(created_at) ORDER BY DATE(created_at)
SELECT COUNT(*) FROM "orders"
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "menu_items"
SELECT COUNT(*) FROM "orders" WHERE (created_at >= '2025-08-27 00:19:04.253412')
SELECT COUNT(*) FROM "users" WHERE (created_at >= '2025-08-27 00:19:04.257930')
SELECT COUNT(*) AS "count_all", "orders"."status" AS "orders_status" FROM "orders" GROUP BY "orders"."status"