app/controllers/admin/auth_controller.rb

  def dashboard
    # Admin dashboard with comprehensive system monitoring
    @admin_username = session[:admin_username]
    # Convert login_time string back to Time object if it exists
    begin
      @login_time = session[:login_time] ? Time.parse(session[:login_time]) : nil
    rescue ArgumentError, TypeError
      # If parsing fails, set to current time as fallback
      @login_time = Time.current
    end

    # System statistics for admin monitoring
    @total_users = User.count
    @active_users = User.active.count
    @users_by_role = User.group(:role).count
    @recent_users = User.order(created_at: :desc).limit(5)

    # Order statistics
    @total_orders = Order.count
    @active_orders = Order.active.count
    @orders_by_status = Order.group(:status).count
    @recent_orders = Order.order(created_at: :desc).limit(5)

    # Menu statistics
    @total_menu_items = MenuItem.count
    @active_menu_items = MenuItem.active.count

    # Table statistics
    @total_tables = Table.count
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) AS "count_all", "users"."role" AS "users_role" FROM "users" GROUP BY "users"."role"
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT 5
SELECT COUNT(*) FROM "orders"
SELECT COUNT(*) AS "count_all", "orders"."status" AS "orders_status" FROM "orders" GROUP BY "orders"."status"
SELECT COUNT(*) FROM "menu_items"
SELECT COUNT(*) FROM "tables"

    @occupied_tables = Table.occupied.count

    # Feedback statistics
    @total_feedbacks = Feedback.count
    @feedbacks_by_rating = Feedback.group(:rating).count
---
SELECT COUNT(*) FROM "feedbacks"
SELECT COUNT(*) AS "count_all", "feedbacks"."rating" AS "feedbacks_rating" FROM "feedbacks" GROUP BY "feedbacks"."rating"