app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."username" ASC
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) AS "count_all", "users"."role" AS "users_role" FROM "users" GROUP BY "users"."role" ORDER BY "users"."username" ASC
---
  def index
    @users = User.all.order(:username)
    @total_users = @users.count
    @active_users = @users.active.count
    @roles_count = @users.group(:role).count