app/controllers/manager_controller.rb

SELECT "inventory_items".* FROM "inventory_items" WHERE (expiry_date < '2025-09-02')
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" IN (4, 5)
SELECT COUNT(*) FROM "inventory_items" WHERE (expiry_date < '2025-09-02')
---
  def dashboard
    @expiring_items = InventoryItem.expiring_soon.includes(:supplier)
    @expired_items = InventoryItem.expired.includes(:supplier)
    @low_stock_items = InventoryItem.where('quantity <= 5').includes(:supplier)
    @available_items = InventoryItem.available.includes(:supplier)
    @today_menu = MenuItem.current_menu
    @recent_transactions = StorekeeperTransaction.includes(:supplier).order(created_at: :desc).limit(5)

    # Calculate alerts count
    @alerts_count = @expiring_items.count + @expired_items.count + @low_stock_items.count