app/controllers/menu_items_controller.rb

  def new
    @menu_item = MenuItem.new
    @available_ingredients = InventoryItem.available.distinct.pluck(:name).sort
---
SELECT DISTINCT "inventory_items"."name" FROM "inventory_items" WHERE (quantity > 0 AND expiry_date >= '2025-09-02')

  def create
    @menu_item = MenuItem.new(menu_item_params)
    @menu_item.created_by = 'manager' # In a real app, this would be current_user

    if @menu_item.save
---
INSERT INTO "menu_items" ("name", "description", "price", "ingredients", "menu_date", "status", "created_by", "created_at", "updated_at") VALUES ('chicken fried rice', 'kkk', 0.4, 'Cheese, Chicken, Eggs', '2025-09-02', 'active', 'manager', '2025-09-02 17:09:51.220629', '2025-09-02 17:09:51.220629') RETURNING "id"