app/controllers/storekeeper_controller.rb

  def index
    @transactions = StorekeeperTransaction.all.includes(:supplier)
---
SELECT "storekeeper_transactions".* FROM "storekeeper_transactions"
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" IN (1, 2)

  def new
    @transaction = StorekeeperTransaction.new
    @suppliers = Supplier.all
---
SELECT "suppliers".* FROM "suppliers"

  def create
    @transaction = StorekeeperTransaction.new(transaction_params)
    @transaction.transaction_id = generate_transaction_id
    if @transaction.save
---
INSERT INTO "storekeeper_transactions" ("transaction_id", "supplier_id", "date", "time", "item", "quantity", "created_at", "updated_at", "unit") VALUES ('TXN-20250902-0001', 1, '2025-09-02', '2000-01-01 16:19:00', 'Chicken', 1, '2025-09-02 16:20:18.147651', '2025-09-02 16:20:18.147651', 'kg') RETURNING "id"

  def generate_transaction_id
    # Generate transaction ID in format: TXN-YYYYMMDD-XXXX
    date_prefix = Date.current.strftime("%Y%m%d")
    last_transaction = StorekeeperTransaction.where("transaction_id LIKE ?", "TXN-#{date_prefix}-%").order(:transaction_id).last
---
SELECT "storekeeper_transactions".* FROM "storekeeper_transactions" WHERE (transaction_id LIKE 'TXN-20250902-%') ORDER BY "storekeeper_transactions"."transaction_id" DESC LIMIT 1