app/controllers/suppliers_controller.rb

INSERT INTO "suppliers" ("supplier_code", "name", "phone_number", "address", "email", "created_at", "updated_at") VALUES ('VEG001', 'AS', '0775705068', 'qww', 'rasikaperera84@gmail.com', '2025-09-02 16:37:54.390961', '2025-09-02 16:37:54.390961') RETURNING "id"
---
  def create
    @supplier = Supplier.new(supplier_params)
    if @supplier.save